groups = ["ТТП-41", "ТТП-42"]
rooms = ["209", "42", "01", "112"]
slots = ["1 пара", "2 пара", "3 пара"]
professors_info = {
    "проф. Олена Шишацька": {
        "subjects": [
            {"subject": "Основи управління IT-проєктами", "type": "лекція"},
        ],
        "max_hours": 3,
        "current_hours": 0,
    },
    "асист. Артемій Мисечко": {

        "subjects": [
            {"subject": "Інтелектуальні системи", "type": "семінар"},
        ],
        "max_hours": 3,
        "current_hours": 0,
    },
    "проф. Олексій Ткаченко": {
        
        "subjects": [
            {"subject": "Розробка ПЗ під мобільні платформи", "type": "лекція"},
            {"subject": "Іформаційні технології", "type": "лекція"},
        ],
        "max_hours": 4,
        "current_hours": 0,
    },
    "доц. Володимир Тарануха": {
        
        "subjects": [
            {"subject": "Інтелектуальні системи", "type": "лекція"},
        ],
        "max_hours": 1,
        "current_hours": 0,
    },
    "проф. Анатолій Пашко": {
       
        "subjects": [
            {"subject": "Стат. моделювання в задачах ШІ", "type": "лекція"},
        ],
        "max_hours": 3,
        "current_hours": 0,
    },
    "проф. Анатолій Дорошенко": {
        
        "subjects": [{"subject": "Методи паралельних обчислень", "type": "лекція"}],
        "max_hours": 3,
        "current_hours": 0,
    },
    "доц. Андрій Криволап": {
        
        "subjects": [
            {"subject": "Розробка ПЗ під мобільні платформи", "type": "семінар"},
            {"subject": "Іформаційні технології", "type": "семінар"},
        ],
        "max_hours": 3,
        "current_hours": 0,
    },
   "доц. Тарас Панченко": {
        "subjects": [ {"subject": "Системне програмування", "type": "семінар"}],
        "max_hours": 4,
        "current_hours": 0,
    },
    "доц. Людмила Омельчук": {
        "subjects": [{"subject": "ІСтТП", "type": "семінар"}],
        "max_hours": 3,
        "current_hours": 0,
    },
}

weekdays = ["Понеділок", "Вівторок", "Середа", "Четвер", "Пʼятниця"]
